// ** 문제를 이해 (Understand the Problem) **
// 1. 문제를 자신의 방식대로 다시 생각할 수 있나? - 문제가 무엇인지를 실제로 이해해야함
// 2. 문제가 어떤 입력값을 담고 있는가?
// 3. 어떤 출력값이 나와야 하는가?
// 4. 입력값이 출력값을 결정할 수 있는가?
// 5. 문제의 일부인 데이터의 중요한 부분에 어떻게 라벨을 지정할 수 있을까? - 문제에서 정말 중요한 것이 무엇인가?


// Example
// 몇 가지 단계를 거치면서 두 숫자를 더하여 합계를 반환하는 함수

// 1. 문제를 자신의 방식대로 다시 생각할 수 있나? - 문제가 무엇인지를 실제로 이해해야함
// 숫자를 더하는 함수를 만들어야한다.
// 2. 문제가 어떤 입력값을 담고 있는가?
// 입력 : 두가지의 숫자 (얼마나 큰 숫자까지 허용하는지? 엄청나게 큰 숫자들을 더하려면 문제가 어려워짐)
// 3. 어떤 출력값이 나와야 하는가?
// 출력 : 한가지의 숫자 (어떤 형태의 숫자가 나올지? 정수, 실수 등등)
// 4. 입력값이 출력값을 결정할 수 있는가?
// 한 숫자만 입력되었을 때? 0을 출력할지 null, undefined를 출력할지?
// 5. 문제의 일부인 데이터의 중요한 부분에 어떻게 라벨을 지정할 수 있을까? - 문제에서 정말 중요한 것이 무엇인가?
// 2개의 숫자를 더해 한개의 숫자를 출력하는 것


